emacs.org
** org

#+begin_src emacs-lisp


  (defun ecfg/org-mode-setup ()
    (org-indent-mode)
    (auto-fill-mode 0)
    (visual-line-mode 1)
    (setq evil-auto-indent nil)
    (diminish org-indent-mode)
    (set-face-attribute 'org-document-title nil :weight 'bold :height 1.4)
    (dolist (face '((org-level-1 . 1.4)
                    (org-level-2 . 1.2)
                    (org-level-3 . 1.2)
                    (org-level-4 . 1.0)
                    (org-level-5 . 1.0)
                    (org-level-6 . 1.0)
                    (org-level-7 . 1.0)
                    (org-level-8 . 1.0)))
      (set-face-attribute (car face) nil :weight 'medium :height (cdr face))))

  (use-package org
    :defer t
    :hook (org-mode . ecfg/org-mode-setup)
    :config
    (setq org-directory "C:/MyData/Workspace/org/")
    (setq org-agenda-files '("C:/MyData/Workspace/org/agenda.org"))
    (setq org-todo-keywords '((sequence "TODO(t)" "PROJ(p)" "|" "DONE(d)" "CANCELED(c)" )))
    ;;(setq org-log-done 'time)
    ;;(setq org-log-done 'note)
    (setq org-ellipsis " ▼"
          org-agenda-files '()
          org-hide-emphasis-markers t
          ))
          ;; org-src-fontify-natively t
          ;; org-fontify-quote-and-verse-blocks t
          ;; org-src-tab-acts-natively t
          ;; org-edit-src-content-indentation 2
          ;; org-hide-block-startup nil
          ;; org-src-preserve-indentation nil
          ;; org-startup-folded 'content
          ;; org-cycle-separator-lines 2))

  (use-package org-superstar
    :after org
    :hook (org-mode . org-superstar-mode)
    :custom
    (org-superstar-remove-leading-stars t)
    (org-superstar-headline-bullets-list '("◎" "○" "●" "○" "●" "○" "●")))


  (require 'org-tempo)

  (add-to-list 'org-structure-template-alist '("sh" . "src sh"))
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("sc" . "src scheme"))
  (add-to-list 'org-structure-template-alist '("ts" . "src typescript"))
  (add-to-list 'org-structure-template-alist '("py" . "src python"))
  (add-to-list 'org-structure-template-alist '("go" . "src go"))
  (add-to-list 'org-structure-template-alist '("yaml" . "src yaml"))
  (add-to-list 'org-structure-template-alist '("json" . "src json"))

  (custom-set-faces
   ;; '(org-block-begin-line
   ;;   ((t (:underline "#A7A6AA" :foreground "#008ED1" :background "#EAEAFF"))))
   '(org-block
     ((t (:background "#202030"))))
   ;; '(org-block-end-line
   ;;   ((t (:overline "#A7A6AA" :foreground "#008ED1" :background "#EAEAFF"))))
   )

#+end_src

** babel

#+begin_src emacs-lisp

  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)))

#+end_src

** auto-tangle

#+begin_src emacs-lisp

  ;; Automatically tangle this config file
  (defun ecfg/org-babel-tangle-config ()
    (when (string-equal (buffer-file-name)
                        (expand-file-name "~/.emacs.d/emacs.org"))
      (let ((org-confirm-babel-evaluate nil))
        (org-babel-tangle))))

  (add-hook 'org-mode-hook
            (lambda () (add-hook
                        'after-save-hook
                        'ecfg/org-babel-tangle-config)))

#+end_src


* Development

** lsp-mode

#+begin_src emacs-lisp

  (use-package lsp-mode
    :config
    (lsp-enable-which-key-integration t))

  (use-package lsp-ui
    :hook (lsp-mode . lsp-ui-mode)
    :custom (lsp-ui-doc-position 'bottom))

  ;; (ecfg/leader-key-def
  ;;   "l"  '(:ignore t :which-key "lsp")
  ;;   "ld" 'xref-find-definitions
  ;;   "lr" 'xref-find-references
  ;;   "ln" 'lsp-ui-find-next-reference
  ;;   "lp" 'lsp-ui-find-prev-reference
  ;;   "ls" 'counsel-imenu
  ;;   "le" 'lsp-ui-flycheck-list
  ;;   "lS" 'lsp-ui-sideline-mode
  ;;   "lX" 'lsp-execute-code-action)

#+end_src

** flycheck

#+begin_src emacs-lisp

  (use-package flycheck
    :hook (prog-mode . flycheck-mode)
    :config
    (setq-default
     flycheck-standard-error-navigation nil
     flycheck-disabled-checkers '(racket)
     flycheck-emacs-lisp-load-path 'inherit))
     ;; flycheck-flake8rc "setupt.cfg"))

#+end_src

** company

#+begin_src emacs-lisp

  (use-package company
    :diminish company-mode
    :hook (prog-mode . company-mode)
    ;; :bind (:map company-active-map
    ;;             ("<tab>" . company-complete-selection))
    ;;       (:map lsp-mode-map
    ;;             ("<tab>" . company-indent-or-complete-common))
    :custom
    (company-minimum-prefix-length 1)
    (company-idle-delay 0.3))

  (use-package company-box
    :hook (company-mode . company-box-mode))

#+end_src

** slime

#+begin_src emacs-lisp

  (load (expand-file-name "~/quicklisp/slime-helper.el"))
  ;; Replace "sbcl" with the path to your implementation
  (setq inferior-lisp-program "sbcl")

#+end_src

** eval-in-repl

#+begin_src emacs-lisp

  (use-package eval-in-repl)

  (defun ecfg/eir-slime-setup ()
    ;(setq eir-jump-after-eval nil)
    (local-set-key (kbd "<C-return>") 'eir-eval-in-slime))

  (require 'eval-in-repl-slime)
  (add-hook 'lisp-mode-hook #'ecfg/eir-slime-setup)


#+end_src

** go

#+begin_src emacs-lisp

  (use-package go-mode
    :mode "\\.go\\'"
    :config
    (setq gofmt-command "goimports")
    (setq flycheck-go-vet-executable "go")
    (setq flfycheck-go-staticcheck-executable "staticcheck")
    (add-hook 'before-save-hook #'gofmt-before-save))

#+end_src

